{"data":{"markdownRemark":{"html":"<h3>Hello, everyone : )</h3>\n<p>Let's continue where we stopped in <em><a href=\"/what-ive-learned-from-beeing-a-developer-in-a-startup\">Part I</a></em>. </p>\n<h3>9. Write code that others can understand, and make sure, that they understand it.</h3>\n<p>Writing code with following best practices and maintaining good structure might not be enough, because code, that looks perfectly readable and structured to you might look like junk to someone else, we all have different habits and understanding of elegance.</p>\n<p>Talking to people saves us yet again, young padawan! </p>\n<p>If your company has established development team meetings(and they really should be a dev team meeting, at least once every 2 weeks), then that is the perfect place to talk about code structure, naming conventions, code style etc. Writing that stuff down right on the spot is a good idea, to make sure nobody forgets <em>( and that is where style guides come from)</em>. It will take you at least an hour or two, to go over details of the code/project structure, but it will save you from months of <em>\"What is this?\"</em> or <em>\"What does it do?\"</em>.</p>\n<p>And once you are all on the same page on how your code and project as a whole should be organized, ask a colleague to have a look at your code once in a while <em>( might not be possible in big teams, but still)</em>, just to make sure that someone else can read it. Because sometimes people just won't tell you, that your code is hard to work with, until it starts to cause all sorts of trouble for them and team as a whole. They can have 10000 different reasons for such behavior, the best thing you can do is to show them that you are ok with receiving criticism. </p>\n<p>When your colleague tells you something like <em>\"I don't understand this part of your code.\"</em> or <em>\"You've used a global variable here, don't do that, please...\"</em>, don't get angry, keep your ego in check. Try to explain reasoning behind your code, explain how it works. It is the right thing to do and a good learning opportunity for all sides of the discussion.</p>\n<h3>10. Learn why good practices are important.</h3>\n<p>Like I said in <em><a href=\"/what-ive-learned-from-beeing-a-developer-in-a-startup\">Part I</a></em>, SOLID, design patterns and best practices exist for a reason. It is important for a developer know them, but also you must know the reason why they exist, what is it that they can protect your project from, what are future benefits.</p>\n<p>In short most of those exist to save you from technological debt,  to make sure your codebase is understandable, resistant to change(your new current changes/additions to codebase don’t break something else in the project ).</p>\n<h3>11. Avoid inventing stuff use existing code whenever you can.</h3>\n<p>As a programmer I love writing my own code, it is fun and gives me that sense of control, but in big project maintaining something like that will give you a headache in a few weeks.</p>\n<p>Long story short… It is better to depend on a stable secure code package, that you know well, than your own solution, that has never earned a single star on GitHub.</p>\n<p>But when it comes to using libraries and frameworks, choose wisely, make sure that it is a good implementation, look at number of stars GitHub  (if we’re talking about open source), check Issues section, make sure it is a good instrument any way you can, and make sure it will help you more than once (YAGNI principle)</p>\n<p>I’m not telling that you should never write your own code, I’m telling that you shouldn’t if there is a better way.</p>\n<blockquote>\n<p><em>\"If I have seen further than others, it is by standing upon the shoulders of giants.\"</em></p>\n<blockquote>\n<blockquote>\n<blockquote>\n<blockquote>\n<blockquote>\n<p><em>Sir Isaac Newton</em> </p>\n</blockquote>\n</blockquote>\n</blockquote>\n</blockquote>\n</blockquote>\n</blockquote>\n<h3>12. Realism and pragmatism.</h3>\n<p>These 2 concepts, in my opinion, are something, every software engineer/developer/programmer must remember and master.</p>\n<p>Realism in this case means, that you must know your current limits, know how much time and effort it will take to overcome them, knowing how much work can be done in the allotted time, knowing strengths and weaknesses of your team and yourself as a developer.</p>\n<p>Pragmatism means, that everything in your work must serve a purpose, best practices must not be followed just because you’ve read about those a few days ago, technology must not be used just because it is the newest thing around. Every concept, every line of code, every meeting must add something to the final product or conditions it is being developed in <em>(saving you time, making it easier to do your job etc.)</em>.</p>\n<h3>13. Validate your solutions before you implement them.</h3>\n<p>To do so write pseudocode and look at number of cases you need to handle\nEven if solution for a problem is already in your head, google it, just to see if there is a better alternative.</p>\n<h3>14. Be ready for changes.</h3>\n<p>If you are in a startup, be ready for your product to change shape, form and concept a dozen of times before and after the initial release. It is just going to happen, so it is in your best interest to be mentally ready for it. </p>\n<p>Btw, from what I’ve seen if your code/project structure is good(everything is divided into separate modules/methods/entities and is logically organized), those changes are less stressful and easier to perform.</p>\n<h3>15. Learn to make ‘time to complete’ estimates.</h3>\n<p>Stuff like this happens, your boss asks you: <em>“When new feature is going to be ready for production?”</em>.\nAnd in less than a second you answer without thinking: <em>“In a week”</em>.</p>\n<p>A 2 weeks later everybody starts: <em>“You said 1 week!!!b Marketing campaign has already started. Other people depend on result of your work.”</em></p>\n<p>And yes, you that did say <em>“1 week”</em>, take responsibility, and next time think before you answer questions like that. This is a simple question, yet it is not to be taken likely.</p>\n<p><em>In future blogs I’ll share a check list of things you might want to think about before you make any ‘time to complete’ estimates for your clients/co-workers.</em></p>\n<h3>Summary</h3>\n<p>In this series I’ve talked about meetings, standards, best practices etc. </p>\n<p>What I’m trying to tell here is that, in every development team(and in every developer) there must be a certain level of discipline when it comes to code quality and organization. That does not mean, that it has to reach level of unnecessary bureaucracy.</p>\n<p>When I say <em>\"know your limits\"</em>, I’m not telling you to stop going forward, I say <em>\"be in touch with reality\"</em>. </p>\n<p>We all have our strengths and weaknesses, working to improve yourself, that is not something anyone should ever forget about, yet it is ok to ask for help or advice from time to time, and it is even better to devote some time to help others.</p>\n<p>In short non of these should be taken to the extremes, finding balance in discipline, team communication, hard work, needed rest, learning etc. is just as important as following each of those concepts individually.</p>\n<p>I hope this blog is going to be of use to you, keep creating cool stuff : ) </p>\n<p><img src=\"/img/blogposts/freedom.jpg\" alt=\"Live, work,create\" title=\"Live, work,create\"></p>\n<p>Sea ya later.</p>\n<p><em>Photo by <a href=\"https://unsplash.com/@bobbystevenson\">Bobby Stevenson</a> on Unsplash</em></p>","frontmatter":{"title":"What I’ve learned from being a developer in a startup - Part II","tags":["Soft skills","Developer life","Startups","Best practices","Code quality"]}}},"pageContext":{"slug":"/home/vladimir_rdv/Desktop/myWebsiteSource/Lessons_From_Startup_Part2/"}}